content/posts/7-core-competencies.md
+++
title = "The Seven Core Competencies of Business Agility"
date = 2021-06-01T23:23:00+08:00
lastmod = 2021-06-01T23:53:43+08:00
draft = false
+++

About [SAFe]({{< relref "safe" >}})


## The Seven Core Competencies of Business Agility {#the-seven-core-competencies-of-business-agility}

-   Team and Technical Agility
-   Agile Product Delivery
-   Enterprise Solution Delivery
-   Lean Portfolio Management
-   Organizational Agility
-   Continuous Learning Culture
-   Lean-Agile Leadership

> It is not enough that management commit themselves to quality and productivity,
> they must know what it is they must do.<br />
> Such a responsibility cannot be delegated.<br />
> -- W. Edwards Deming


## Measure and Grow {#measure-and-grow}

Go download the "SAFe Business Agility Assessment" from [here](https://www.scaledagileframework.com/measure-and-grow/).


## Reference {#reference}

-   <https://www.scaledagileframework.com/business-agility/>
-   <https://www.scaledagileframework.com/measure-and-grow/>
